##Вычисления с помощью Numpy

Задание 1
Создайте массив Numpy под названием a размером 5x2, то есть состоящий из 5 строк и 2 столбцов. Первый столбец должен содержать числа 1, 2, 3, 3, 1, а второй - числа 6, 8, 11, 10, 7. Будем считать, что каждый столбец - это признак, а строка - наблюдение. Затем найдите среднее значение по каждому признаку, используя метод mean массива Numpy. Результат запишите в массив mean_a, в нем должно быть 2 элемента.

In [66]:
import numpy as np

In [67]:
B = np.array([[1, 2, 3, 3, 1], [6, 8, 11, 10, 7]])
A = B.T.copy()
A

array([[ 1,  6],
       [ 2,  8],
       [ 3, 11],
       [ 3, 10],
       [ 1,  7]])

In [68]:
mean_a = np.array(np.mean(A, axis=0 ))
mean_a

array([2. , 8.4])

Задание 2
Вычислите массив a_centered, отняв от значений массива “а” средние значения соответствующих признаков, содержащиеся в массиве mean_a. Вычисление должно производиться в одно действие. Получившийся массив должен иметь размер 5x2.

In [69]:
a_centered = A - mean_a
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

Задание 3 
Найдите скалярное произведение столбцов массива a_centered. В результате должна получиться величина a_centered_sp. Затем поделите a_centered_sp на N-1, где N - число наблюдений.

In [70]:
# a_centered_sp = a_centered[:,1] @ a_centered[:,0]
# a_centered_sp / (len(a_centered[:,0]) - 1)
a_centered_sp = np.dot(a_centered[:,0], a_centered[:,1])
a_centered_sp / (np.shape(a_centered[:,0])[0] - 1)

2.0

Задание 4 
Число, которое мы получили в конце задания 3 является ковариацией двух признаков, содержащихся в массиве “а”. В задании 4 мы делили сумму произведений центрированных признаков на N-1, а не на N, поэтому полученная нами величина является несмещенной оценкой ковариации.

In [71]:
np.cov(A.T)[0,1]

2.0

### Работа с данными в Pandas

Задание 1
Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].
Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно содержатся данные:  
[1, 1, 1, 2, 2, 3, 3],
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
[450, 300, 350, 500, 450, 370, 290].

In [72]:
import pandas as pd

In [73]:
df_1 = pd.DataFrame(data = {"author_id":[1, 2, 3], "author_name":['Тургенев', 'Чехов', 'Островский']})
df_1

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [74]:
df_2 = pd.DataFrame(data = {"author_id" : [1, 1, 1, 2, 2, 3, 3], 
                            "book_title" : ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
                            "price" : [450, 300, 350, 500, 450, 370, 290]})
df_2

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

Задание 2
Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [75]:
authors_price = pd.merge(df_1,df_2, on = "author_id")
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

Задание 3
Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [76]:
top5 = authors_price.sort_values("price").tail(5).copy()
top5

   author_id author_name         book_title  price
2          1    Тургенев  Дворянское гнездо    350
5          3  Островский              Гроза    370
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
3          2       Чехов   Толстый и тонкий    500

Задание 4
Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя цена на книги этого автора.

In [77]:
author_stat_dict = {"author_name" : [],
                    "min_price" : [],
                    "max_price" : [],
                    "mean_price" : []}
for id in pd.unique(authors_price['author_id']):
    author_stat_dict["author_name"] += list(pd.unique(authors_price.loc[authors_price['author_id'] == id]["author_name"]))
    author_stat_dict["min_price"].append(min(pd.unique(authors_price.loc[authors_price['author_id'] == id]["price"])))
    author_stat_dict["max_price"].append(max(pd.unique(authors_price.loc[authors_price['author_id'] == id]["price"])))
    author_stat_dict["mean_price"].append(np.average(pd.unique(authors_price.loc[authors_price['author_id'] == id]["price"])))

author_stat = pd.DataFrame(author_stat_dict)
author_stat

  author_name  min_price  max_price  mean_price
0    Тургенев        300        450  366.666667
1       Чехов        450        500  475.000000
2  Островский        290        370  330.000000

Задание 5 
Создайте новый столбец в датафрейме authors_price под названием cover, в нем будут располагаться данные о том, какая обложка у данной книги - твердая или мягкая. В этот столбец поместите данные из следующего списка:
['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'].
Просмотрите документацию по функции pd.pivot_table с помощью вопросительного знака.Для каждого автора посчитайте суммарную стоимость книг в твердой и мягкой обложке. Используйте для этого функцию pd.pivot_table. При этом столбцы должны называться "твердая" и "мягкая", а индексами должны быть фамилии авторов. Пропущенные значения стоимостей заполните нулями, при необходимости загрузите библиотеку Numpy.
Назовите полученный датасет book_info и сохраните его в формат pickle под названием "book_info.pkl". Затем загрузите из этого файла датафрейм и назовите его book_info2. Удостоверьтесь, что датафреймы book_info и book_info2 идентичны.

In [78]:
authors_price["cover"] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
book_info = pd.pivot_table(data= authors_price, values='price',index=["author_name"],  columns=["cover"],  aggfunc=np.sum)
book_info["твердая"].fillna(0, inplace=True)
book_info["мягкая"].fillna(0, inplace=True)
book_info

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0

In [79]:
book_info.to_pickle('book_info1.pkl')
book_info2 = pd.read_pickle('book_info1.pkl')
book_info.compare(book_info2)

Empty DataFrame
Columns: []
Index: []